Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: فأوحى إلى عبده ما أوحى
en: So (Allah) revealed to His slave [Muhammad صلى الله عليه وسلم through Jibril (Gabriel) عليه السلام] whatever He revealed.

source: ما كذب الفؤاد ما رأى
en: The (Prophet's) heart lied not in what he (Muhammad صلى الله عليه وسلم) saw.

source: أفتمارونه على ما يرى
en: Will you then dispute with him (Muhammad صلى الله عليه وسلم) about what he saw [during the Mi'raj: (Ascent of the Prophet صلى الله عليه وسلم to the seven heavens)]

source: ولقد رآه نزلة أخرى
en: And indeed he (Muhammad صلى الله عليه وسلم) saw him [Jibril (Gabriel)] at a second descent (i.e. another time).

source: عند سدرة المنتهى
en: Near Sidrat-ul-Muntaha (a lote-tree of the utmost boundary over the seventh heaven beyond which none can pass).

source: عندها جنة المأوى
en: Near it is the Paradise of Abode.

source: إذ يغشى السدرة ما يغشى
en: When that covered the lote-tree which did cover it!

source: ما زاغ البصر وما طغى
en: The sight (of Prophet Muhammad صلى الله عليه وسلم) turned not aside (right or left), nor it transgressed beyond the limit (ordained for it).

source: لقد رأى من آيات ربه الكبرى
en: Indeed he (Muhammad صلى الله عليه وسلم) did see of the Greatest Signs, of his Lord (Allah).

source: أفرأيتم اللات والعزى
en: Have you then considered Al-Lat, and Al-'Uzza (two idols of the pagan Arabs)

source: ومناة الثالثة الأخرى
en: And Manat (another idol of the pagan Arabs), the other third?

source: ألكم الذكر وله الأنثى
en: Is it for you the males and for Him the females?

source: تلك إذا قسمة ضيزى
en: That indeed is a division most unfair!

source: إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى
en: They are but names which you have named - you and your fathers - for which Allah has sent down no authority. They follow but a guess and that which they themselves desire, whereas there has surely come to them the Guidance from their Lord!

source: أم للإنسان ما تمنى
en: Or shall man have what he wishes?

source: فلله الآخرة والأولى
en: But to Allah belongs the last (Hereafter) and the first (the world).

source: وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى
en: And there are many angels in the heavens, whose intercession will avail nothing except after Allah has given leave for whom He wills and is pleased with.

source: إن الذين لا يؤمنون بالآخرة ليسمون الملائكة تسمية الأنثى
en: Verily, those who believe not in the Hereafter, name the angels with female names.

source: وما لهم به من علم إن يتبعون إلا الظن وإن الظن لا يغني من الحق شيئا
en: But they have no knowledge thereof. They follow but a guess, and verily, guess is no substitute for the truth.

source: فأعرض عن من تولى عن ذكرنا ولم يرد إلا الحياة الدنيا
en: Therefore withdraw (O Muhammad صلى الله عليه وسلم) from him who turns away from Our Reminder (this Qur'an) and desires nothing but the life of this world.

source: ذلك مبلغهم من العلم إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بمن اهتدى
en: That is what they could reach of knowledge. Verily, your Lord it is He Who knows best him who goes astray from His Path, and He knows best him who receives guidance.

source: ولله ما في السماوات وما في الأرض ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى
en: And to Allah belongs all that is in the heavens and all that is in the earth, that He may requite those who do evil with that which they have done (i.e. punish them in Hell), and reward those who do good, with what is best (i.e. Paradise).

source: الذين يجتنبون كبائر الإثم والفواحش إلا اللمم إن ربك واسع المغفرة هو أعلم بكم إذ أنشأكم من الأرض وإذ أنتم أجنة في بطون أمهاتكم فلا تزكوا أنفسكم هو أعلم بمن اتقى
en: Those who avoid great sins (See the Qur'an, Verses: 6:152,153) and Al-Fawahish (illegal sexual intercourse) except the small faults, - verily, your Lord is of Vast Forgiveness. He knows you well when He created you from the earth (Adam), and when you were fetuses in your mothers' wombs. So ascribe not purity to yourselves. He knows best him who fears Allah and keeps his duty to Him [i.e. those who are Al-Muttaqun (the pious. See V.2:2)].

source: أفرأيت الذي تولى
en: Did you (O Muhammad صلى الله عليه وسلم) observe him who turned away (from Islam).

source: وأعطى قليلا وأكدى
en: And gave a little, then stopped (giving)?

source: أعنده علم الغيب فهو يرى
en: Is with him the knowledge of the Unseen so that he sees?

source: أم لم ينبأ بما في صحف موسى
en: Or is he not informed with what is in the Pages (Scripture) of Musa (Moses),

source: وإبراهيم الذي وفى
en: And of Ibrahim (Abraham) who fulfilled (or conveyed) all that (Allah ordered him to do or convey):

source: ألا تزر وازرة وزر أخرى
en: That no burdened person (with sins) shall bear the burden (sins) of another.

source: وأن ليس للإنسان إلا ما سعى
en: And that man can have nothing but what he does (good or bad).

source: وأن سعيه سوف يرى
en: And that his deeds will be seen.

source: ثم يجزاه الجزاء الأوفى
en: Then he will be recompensed with a full and the best recompense.

source: وأن إلى ربك المنتهى
en: And that to your Lord (Allah) is the End (Return of everything).

source: وأنه هو أضحك وأبكى
en: And that it is He (Allah) Who makes (whom He wills) laugh, and makes (whom He wills) weep.

source: وأنه هو أمات وأحيا
en: And that it is He (Allah) Who causes death and gives life.

source: وأنه خلق الزوجين الذكر والأنثى
en: And that He (Allah) creates the pairs, male and female,

source: من نطفة إذا تمنى
en: From Nutfah (drops of semen - male and female discharges) when it is emitted.

source: وأن عليه النشأة الأخرى
en: And that upon Him (Allah) is another bringing forth (Resurrection).

source: وأنه هو أغنى وأقنى
en: And that it is He (Allah) Who gives much or a little (of wealth and contentment)

source: وأنه هو رب الشعرى
en: And that He (Allah) is the Lord of Sirius (the star which the pagan Arabs used to worship).

source: وأنه أهلك عادا الأولى
en: And that it is He (Allah) Who destroyed the former 'Ad (people),

source: وثمود فما أبقى
en: And Thamud (people): He spared none of them.

source: وقوم نوح من قبل إنهم كانوا هم أظلم وأطغى
en: And the people of Nuh (Noah) aforetime. Verily, they were more unjust and more rebellious and transgressing [in disobeying Allah and His Messenger Nuh (Noah) عليه السلام].

source: والمؤتفكة أهوى
en: And He destroyed the overthrown cities [of Sodom to which Prophet Lut (Lot) was sent].

source: فغشاها ما غشى
en: So there covered them that which did cover (i.e. torment with stones).

source: فبأي آلاء ربك تتمارى
en: Then which of the Graces of your Lord (O man!) will you doubt?

source: هذا نذير من النذر الأولى
en: This (Muhammad صلى الله عليه وسلم) is a warner (Messenger) of the (series of) warners (Messengers) of old.

source: أزفت الآزفة
en: The Day of Resurrection draws near.

source: ليس لها من دون الله كاشفة
en: None besides Allah can avert it (or advance it or delay it).

source: أفمن هذا الحديث تعجبون
en: Do you then wonder at this recitation (the Qur'an)?

source: وتضحكون ولا تبكون
en: And you laugh at it and weep not,

source: وأنتم سامدون
en: Wasting your (precious) lifetime in pastime and amusements (singing, etc.).

source: فاسجدوا لله واعبدوا
en: So fall you down in prostration to Allah and worship Him (Alone).

source: اقتربت الساعة وانشق القمر
en: The Hour has drawn near, and the moon has been cleft asunder (the people of Makkah requested Prophet Muhammad صلى الله عليه وسلم to show them a miracle, so he showed them the splitting of the moon).

source: وإن يروا آية يعرضوا ويقولوا سحر مستمر
en: And if they see a sign, they turn away, and say: "This is continuous magic."

source: وكذبوا واتبعوا أهواءهم وكل أمر مستقر
en: They belied (the Verses of Allah - this Qur'an), and followed their own lusts. And every matter will be settled (according to the kind of deeds: good deeds will take their doers to Paradise, and similarly evil deeds will take their doers to Hell).

source: ولقد جاءهم من الأنباء ما فيه مزدجر
en: And indeed there has come to them news (in this Qur'an) wherein there is (enough warning) to check (them from evil),

source: حكمة بالغة فما تغن النذر
en: Perfect wisdom (this Qur'an), but (the preaching of) warners benefit them not.

source: فتول عنهم يوم يدع الداع إلى شيء نكر
en: So (O Muhammad صلى الله عليه وسلم) withdraw from them. The Day that the caller will call (them) to a terrible thing.

source: خشعا أبصارهم يخرجون من الأجداث كأنهم جراد منتشر
en: They will come forth, with humbled eyes from (their) graves as if they were locusts spread abroad,

source: مهطعين إلى الداع يقول الكافرون هذا يوم عسر
en: Hastening towards the caller. The disbelievers will say: "This is a hard Day."

source: كذبت قبلهم قوم نوح فكذبوا عبدنا وقالوا مجنون وازدجر
en: The people of Nuh (Noah) denied (their Messenger) before them. They rejected Our slave, and said: "A madman!" and he was insolently rebuked and threatened.

source: فدعا ربه أني مغلوب فانتصر
en: Then he invoked his Lord (saying): "I have been overcome, so help (me)!"

source: ففتحنا أبواب السماء بماء منهمر
en: So We opened the gates of the heaven with water pouring forth.

source: وفجرنا الأرض عيونا فالتقى الماء على أمر قد قدر
en: And We caused springs to gush forth from the earth. So the waters (of the heaven and the earth) met for a matter predestined.

source: وحملناه على ذات ألواح ودسر
en: And We carried him on a (ship) made of planks and nails,

source: تجري بأعيننا جزاء لمن كان كفر
en: Floating under Our Eyes: a reward for him who had been rejected!

source: ولقد تركناها آية فهل من مدكر
en: And indeed, We have left this as a sign. Then is there any that will remember (or receive admonition)?

source: فكيف كان عذابي ونذر
en: Then how (terrible) was My Torment and My Warnings?

source: ولقد يسرنا القرآن للذكر فهل من مدكر
en: And We have indeed made the Qur'an easy to understand and remember; then is there any one who will remember (or receive admonition)?

source: كذبت عاد فكيف كان عذابي ونذر
en: 'Ad (people) belied (their Prophet, Hud); then how (terrible) was My Torment and My Warnings?

source: إنا أرسلنا عليهم ريحا صرصرا في يوم نحس مستمر
en: Verily, We sent against them a furious wind of harsh voice on a day of evil omen and continuous calamity.

source: تنزع الناس كأنهم أعجاز نخل منقعر
en: Plucking out men as if they were uprooted stems of date-palms.

source: كذبت ثمود بالنذر
en: Thamud (people also) belied the warnings.

source: فقالوا أبشرا منا واحدا نتبعه إنا إذا لفي ضلال وسعر
en: And they said: "A man, alone among us - shall we follow him? Truly then we should be in error and distress (or madness)!"

source: أألقي الذكر عليه من بيننا بل هو كذاب أشر
en: "Is it that the Reminder is sent to him [Prophet Salih عليه السلام] alone from among us? Nay, he is an insolent liar!"

source: سيعلمون غدا من الكذاب الأشر
en: Tomorrow they will come to know who is the liar, the insolent one!

source: إنا مرسلو الناقة فتنة لهم فارتقبهم واصطبر
en: Verily, We are sending the she-camel as a test for them. So watch them [O Salih عليه السلام], and be patient!

source: ونبئهم أن الماء قسمة بينهم كل شرب محتضر
en: And inform them that the water is to be shared between (her and) them, each one's right to drink being established (by turns).

source: فنادوا صاحبهم فتعاطى فعقر
en: But they called their comrade and he took (a sword) and killed (her).

source: إنا أرسلنا عليهم صيحة واحدة فكانوا كهشيم المحتظر
en: Verily, We sent against them a single Saihah (torment - awful cry), and they became like the stubble of a fold-builder.

source: كذبت قوم لوط بالنذر
en: The people of Lut (Lot) belied the warnings.

source: إنا أرسلنا عليهم حاصبا إلا آل لوط نجيناهم بسحر
en: Verily, We sent against them a violent storm of stones (which destroyed them all), except the family of Lut (Lot), them We saved in the last hour of the night,

source: نعمة من عندنا كذلك نجزي من شكر
en: As a Favour from Us. Thus do We reward him who gives thanks (by obeying Us).

source: ولقد أنذرهم بطشتنا فتماروا بالنذر
en: And he [Lut (Lot)] indeed had warned them of Our Seizure (punishment), but they did doubt the warnings!

source: ولقد راودوه عن ضيفه فطمسنا أعينهم فذوقوا عذابي ونذر
en: And they indeed sought to shame his guest (by asking to commit sodomy with them). So We blinded their eyes, (saying) "Then taste you My Torment and My Warnings."

source: ولقد صبحهم بكرة عذاب مستقر
en: And verily, an abiding torment seized them early in the morning.

source: فذوقوا عذابي ونذر
en: "Then taste you My Torment and My Warnings."

source: ولقد جاء آل فرعون النذر
en: And indeed, warnings came to the people of Fir'aun (Pharaoh) [through Musa (Moses) and Harun (Aaron)].

source: كذبوا بآياتنا كلها فأخذناهم أخذ عزيز مقتدر
en: (They) belied all Our Signs, so We seized them with a Seizure of the All-Mighty, All-Capable (Omnipotent).

source: أكفاركم خير من أولئكم أم لكم براءة في الزبر
en: Are your disbelievers (O Quraish!) better than these [nations of Nuh (Noah), Lut (Lot), Salih, and the people of Fir'aun (Pharaoh) who were destroyed)? Or have you an immunity (against Our Torment) in the Divine Scriptures?

source: أم يقولون نحن جميع منتصر
en: Or say they: "We are a great multitude, victorious?"

source: سيهزم الجمع ويولون الدبر
en: Their multitude will be put to flight, and they will show their backs.

source: بل الساعة موعدهم والساعة أدهى وأمر
en: Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter.

source: إن المجرمين في ضلال وسعر
en: Verily the Mujrimun (polytheists, disbelievers, sinners, criminals) are in error (in this world) and will burn (in the Hell-fire in the Hereafter).

source: يوم يسحبون في النار على وجوههم ذوقوا مس سقر
en: The Day they will be dragged on their faces into the Fire (it will be said to them): "Taste you the touch of Hell!"

source: إنا كل شيء خلقناه بقدر
en: Verily, We have created all things with Qadar (Divine Preordainments of all things before their creation as written in the Book of Decrees Al-Lauh Al-Mahfuz).

source: وما أمرنا إلا واحدة كلمح بالبصر
en: And Our Commandment is but one as the twinkling of an eye.

source: ولقد أهلكنا أشياعكم فهل من مدكر
en: And indeed, We have destroyed your likes; then is there any that will remember (or receive admonition)?

source: وكل شيء فعلوه في الزبر
en: And everything they have done is noted in (their) Records (of deeds).

source: وكل صغير وكبير مستطر
en: And everything, small and big, is written down (in Al-Lauh Al-Mahfuz already beforehand i.e. before it befalls, or is done by its doer: الإيمان بالقدر) (See the Qur'an V.57:22 and its footnote).

source: إن المتقين في جنات ونهر
en: Verily, The Muttaqun (the pious - see V.2:2), will be in the midst of Gardens and Rivers (Paradise).

source: في مقعد صدق عند مليك مقتدر
en: In a seat of truth (i.e. Paradise), near the Omnipotent King (Allah, the One, the All-Blessed, the Most High, the Owner of Majesty and Honour).

source: الرحمن
en: The Most Gracious (Allah)!

source: علم القرآن
en: He has taught (you mankind) the Qur'an (by His Mercy).

source: خلق الإنسان
en: He created man.

source: علمه البيان
en: He taught him eloquent speech.

source: الشمس والقمر بحسبان
en: The sun and the moon run on their fixed courses (exactly) calculated with measured out stages for each (for reckoning).

source: والنجم والشجر يسجدان
en: And the herbs (or stars) and the trees both prostrate themselves (to Allah - See V.22:18) (Tafsir Ibn Kathir)

source: والسماء رفعها ووضع الميزان
en: And the heaven: He has raised it high, and He has set up the Balance.

source: ألا تطغوا في الميزان
en: In order that you may not transgress (due) balance.

source: وأقيموا الوزن بالقسط ولا تخسروا الميزان
en: And observe the weight with equity and do not make the balance deficient.

source: والأرض وضعها للأنام
en: And the earth: He has put down (laid) for the creatures.

source: فيها فاكهة والنخل ذات الأكمام
en: Therein are fruits and date-palms producing sheathed fruit-stalks (enclosing dates).

source: والحب ذو العصف والريحان
en: And also corn, with (its) leaves and stalk for fodder, and sweet-scented plants.

source: فبأي آلاء ربكما تكذبان
en: Then which of the Blessings of your Lord will you both (jinn and men) deny?

source: خلق الإنسان من صلصال كالفخار
en: He created man (Adam) from sounding clay like the clay of pottery.

source: وخلق الجان من مارج من نار
en: And the jinn: He created from a smokeless flame of fire.

source: رب المشرقين ورب المغربين
en: (He is) the Lord of the two easts (places of sunrise during early summer and early winter) and the Lord of the two wests (places of sunset during early summer and early winter).

source: مرج البحرين يلتقيان
en: He has let loose the two seas (the salt and fresh water) meeting together.

source: بينهما برزخ لا يبغيان
en: Between them is a barrier which none of them can transgress.

source: يخرج منهما اللؤلؤ والمرجان
en: Out of them both come out pearl and coral.

source: وله الجوار المنشآت في البحر كالأعلام
en: And His are the ships going and coming in the seas, like mountains.

source: كل من عليها فان
en: Whatsoever is on it (the earth) will perish.

source: ويبقى وجه ربك ذو الجلال والإكرام
en: And the Face of your Lord full of Majesty and Honour will remain forever.

source: يسأله من في السماوات والأرض كل يوم هو في شأن
en: Whosoever is in the heavens and on earth begs of Him (its needs from Him). Every day He is (engaged) in some affair (such as giving honour or disgrace to some, life or death to some, etc.)!

source: سنفرغ لكم أيه الثقلان
en: We shall attend to you, O you two classes (jinn and men)!

source: يا معشر الجن والإنس إن استطعتم أن تنفذوا من أقطار السماوات والأرض فانفذوا لا تنفذون إلا بسلطان
en: O assembly of jinn and men! If you have power to pass beyond the zones of the heavens and the earth, then pass beyond (them)! But you will never be able to pass them, except with authority (from Allah)!

source: يرسل عليكما شواظ من نار ونحاس فلا تنتصران
en: There will be sent against you both, smokeless flames of fire and (molten) brass, and you will not be able to defend yourselves.

source: فإذا انشقت السماء فكانت وردة كالدهان
en: Then when the heaven is rent asunder, and it becomes rosy or red like red-oil, or red hide - [See V.70:8]

source: فيومئذ لا يسأل عن ذنبه إنس ولا جان
en: So on that Day no question will be asked of man or jinns as to his sin, [because they have already been known from their faces either white (dwellers of Paradise - true believers of Islamic Monotheism) or black (dwellers of Hell - polytheists; disbelievers, criminals)].

source: يعرف المجرمون بسيماهم فيؤخذ بالنواصي والأقدام
en: The Mujrimun (polytheists, criminals, sinners) will be known by their marks (black faces), and they will be seized by their forelocks and their feet.

source: هذه جهنم التي يكذب بها المجرمون
en: This is the Hell which the Mujrimun (polytheists, criminals, sinners) denied.

source: يطوفون بينها وبين حميم آن
en: They will go between it (Hell) and the fierce boiling water!

source: ولمن خاف مقام ربه جنتان
en: But for him who fears the standing before his Lord, there will be two Gardens (i.e. in Paradise).

source: ذواتا أفنان
en: With spreading branches.

source: فيهما عينان تجريان
en: In them (both) will be two springs flowing (free).

source: فيهما من كل فاكهة زوجان
en: In them (both) will be every kind of fruit in pairs.

source: متكئين على فرش بطائنها من إستبرق وجنى الجنتين دان
en: Reclining upon the couches lined with silk brocade, and the fruits of the two Gardens will be near at hand.

source: فيهن قاصرات الطرف لم يطمثهن إنس قبلهم ولا جان
en: Wherein both will be Qasirat-ut-Tarf [chaste females (wives) restraining their glances, desiring none except their husbands], with whom no man or jinni has had tamth before them.

source: كأنهن الياقوت والمرجان
en: (In beauty) they are like rubies and coral.

source: هل جزاء الإحسان إلا الإحسان
en: Is there any reward for good other than good?

source: ومن دونهما جنتان
en: And besides these two, there are two other Gardens (i.e. in Paradise).

source: مدهامتان
en: Dark green (in colour).

source: فيهما عينان نضاختان
en: In them (both) will be two springs gushing forth.

source: فيهما فاكهة ونخل ورمان
en: In them (both) will be fruits, and date-palms and pomegranates.

source: فيهن خيرات حسان
en: Therein (Gardens) will be Khairatun-Hisan [fair (wives) good and beautiful];

source: حور مقصورات في الخيام
en: Hur (beautiful, fair females) guarded in pavilions;

source: لم يطمثهن إنس قبلهم ولا جان
en: With whom no man or jinni has had tamth before them.

source: متكئين على رفرف خضر وعبقري حسان
en: Reclining on green cushions and rich beautiful mattresses.

source: تبارك اسم ربك ذي الجلال والإكرام
en: Blessed be the Name of your Lord (Allah), the Owner of Majesty and Honour.

source: إذا وقعت الواقعة
en: When the Event (i.e. the Day of Resurrection) befalls.

source: ليس لوقعتها كاذبة
en: And there can be no denial of its befalling.

source: خافضة رافعة
en: Bringing low (some - those who will enter Hell) Exalting (others - those who will enter Paradise). [Tafsir Ibn Kathir]

source: إذا رجت الأرض رجا
en: When the earth will be shaken with a terrible shake.

source: وبست الجبال بسا
en: And the mountains will be powdered to dust,

source: فكانت هباء منبثا
en: So that they will become floating dust particles.

source: وكنتم أزواجا ثلاثة
en: And you (all) will be in three groups.

source: فأصحاب الميمنة ما أصحاب الميمنة
en: So those on the Right Hand (i.e. those who will be given their Records in their right hands) - how (fortunate) will be those on the Right Hand! (As a respect for them, because they will enter Paradise).

source: وأصحاب المشأمة ما أصحاب المشأمة
en: And those on the Left Hand (i.e. those who will be given their Record in their left hands) - how (unfortunate) will be those on the Left Hand! (As a disgrace for them, because they will enter Hell).

source: والسابقون السابقون
en: And those foremost [(in Islamic Faith of Monotheism and in performing righteous deeds) in the life of this world on the very first call for to embrace Islam] will be foremost (in Paradise).

source: أولئك المقربون
en: These will be the nearest (to Allah).

source: ثلة من الأولين
en: A multitude of those (foremost) will be from the first generations (who embraced Islam).

source: وقليل من الآخرين
en: And a few of those (foremost) will be from the later generations.

source: على سرر موضونة
en: (They will be) on thrones woven with gold and precious stones.

source: متكئين عليها متقابلين
en: Reclining thereon, face to face.

source: يطوف عليهم ولدان مخلدون
en: Immortal boys will go around them (serving),

source: بأكواب وأباريق وكأس من معين
en: With cups, and jugs, and a glass of flowing wine,

source: لا يصدعون عنها ولا ينزفون
en: Wherefrom they will get neither any aching of the head, nor any intoxication.

source: وفاكهة مما يتخيرون
en: And with fruit that they may choose.

source: ولحم طير مما يشتهون
en: And with the flesh of fowls that they desire.

source: وحور عين
en: And (there will be) Hur (fair females) with wide, lovely eyes (as wives for "Al-Muttaqun" - the pious - See V. 2:2),

source: كأمثال اللؤلؤ المكنون
en: Like unto preserved pearls.

source: جزاء بما كانوا يعملون
en: A reward for what they used to do.

source: لا يسمعون فيها لغوا ولا تأثيما
en: No Laghw (dirty, false, evil vain talk) will they hear therein, nor any sinful speech (like backbiting).

source: إلا قيلا سلاما سلاما
en: But only the saying of: Salam! Salam! (greetings with peace)!

source: وأصحاب اليمين ما أصحاب اليمين
en: And those on the Right Hand - how (fortunate) will be those on the Right Hand?

source: في سدر مخضود
en: (They will be) among thornless lote-trees,

source: وطلح منضود
en: And among Talh (banana-trees) with fruits piled one above another,

source: وظل ممدود
en: And in shade long-extended,

source: وماء مسكوب
en: And by water flowing constantly,
